#language: ru

  @02
Функционал: Яндекс Маркет
  Сценарий: Проверка наушников

    Когда выбран пункт меню главной страницы "Маркет"
    Когда выбран раздел "Электроника"
    Когда выбран тип товара "Наушники"
    Когда задана цена
      |от|5000|
    Когда выбран чекбокс "Beats"
    Когда выполнено нажатие на кнопку Применить
    Когда выполнена проверка колличества товаров наушники на странице
    Когда в форму поиска введено название товара "наушники"
    Когда выполнено нажатие на кнопку Найти
    Когда выполнена проверка заголовка
