#language: ru

  @01
  @all

Функционал: Яндекс Маркет
  Сценарий: Проверка телевизоров

    Когда выбран пункт меню главной страницы "Маркет"
    Когда выбран раздел "Электроника"
    Когда выбран вид товара "Телевизоры"
    Когда задана цена
    |от|20000|
    Когда выбран чекбокс "LG"
    Когда выбран чекбокс "Samsung"
    Когда выполнено нажатие на кнопку Применить
    Когда выполнена проверка колличества товаров "телевизор" на странице
    Когда в форму поиска введено название товара "телевизор"
    Когда выполнено нажатие на кнопку Найти
    Когда выполнена проверка заголовка

